-- MySQL dump 10.13  Distrib 8.0.29, for Win64 (x86_64)
--
-- Host: 127.0.0.1    Database: cinema
-- ------------------------------------------------------
-- Server version	8.0.29

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `film`
--

DROP TABLE IF EXISTS `film`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `film` (
  `idFilm` int NOT NULL AUTO_INCREMENT,
  `filmname` varchar(50) NOT NULL,
  `img_name` varchar(35) NOT NULL,
  `nezabarom` tinyint NOT NULL DEFAULT '0',
  `video_name` varchar(35) DEFAULT NULL,
  `form` varchar(10) DEFAULT '2D',
  `rik` char(4) DEFAULT NULL,
  `zhanr` varchar(50) DEFAULT NULL,
  `rezhiser` varchar(60) DEFAULT NULL,
  `studia` varchar(60) DEFAULT NULL,
  `kraina` varchar(35) DEFAULT NULL,
  `trivalist` smallint DEFAULT NULL,
  `obmezhennya` char(3) DEFAULT NULL,
  `opis` text,
  `roli` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`idFilm`),
  UNIQUE KEY `adress_UNIQUE` (`filmname`),
  UNIQUE KEY `img_name_UNIQUE` (`img_name`),
  UNIQUE KEY `video_name_UNIQUE` (`video_name`)
) ENGINE=InnoDB AUTO_INCREMENT=29 DEFAULT CHARSET=utf8mb3;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `film`
--

LOCK TABLES `film` WRITE;
/*!40000 ALTER TABLE `film` DISABLE KEYS */;
INSERT INTO `film` VALUES (16,'ДОГ','dog.jpeg',0,'Dog','2D','2022','Пригоди, Комедія, Сімейний','Рід Каролін, Чаннінг Татум','MGM','США, Іспанія',98,'12','Військовий у відставці Бріггс відданий своїй бельгійській вівчарці Лулу як нікому іншому, адже собаку тренував його найкращий друг. Коли приходить звістка про смерть товариша, Бріггс із вихованцем вирушають на похорон. Удвох вони пройдуть довгий шлях уздовж Тихоокеанського узбережжя.','Ченнінг Татум, Джейн Адамс, Кевін Неш, Кейден Бойд, Акілла Золл, Ронні Джин Блевінс, Ніколь Лаліберт, Аманда Бут, Патріша Айзек, Скайлер Джой'),(17,'ГРА ТІНЕЙ','gra tiney.jpeg',0,'Blacklight.mp4','2D','2022','бойовик, екшн','Марк Вільямс','Solution Entertainment Group','Китай, Австралія, США',108,'16','Тревіс Блок - позаштатний агент ФБР, який за наказом керівництва допомагає агентам, впровадженим в кримінальні круги, вийти з делікатних ситуацій. Але одного разу і він опиняється у центрі змови...','Ліам Нісон'),(18,'СМЕРТЬ НА НІЛІ','smert na nili.jpeg',0,'Смерть на Нілі.mp4','2D','2022','Детектив, Кримінал','Кеннет Брана','Twentieth Century Studios','США, Великобританія',127,'16','Цього разу необхідність розслідувати загадкове вбивство, відволікаючись від власного відпочинку, наздоганяє Пуаро на борту розкішного круїзного пароплава, що йде вздовж Нілу.','Кеннет Брана, Галь Гадот, Софі Оконедо, Роуз Леслі, Армі Хаммер, Емма Маккей, Летішіа Райт'),(19,'ВЕЛИКА ПРОГУЛЯНКА','velika progulanka.jpeg',0,'Велика прогулянка.mp4','2D','2021','Комедія, Сімейний','Олег Зборовський','FILM.UA Group и телеканал \"Украина\"','УкраЇна',90,'0','Сюжет комедії розгортається навколо двох абсолютно різних сімей: працівників культури Драгоманових та районних бізнесменів Наливайченка. У теплі весняні вихідні вони вирішують традиційно вибратися «на шашлики» - і доля зводить їх на одній галявині, яку кожна сім\'я вважає «своєю». Між ними розгорається суперечка, переростає у гротескну «війну» за місце під мангал. Несподівано з\'являється і третій претендент - корупціонер-утікач, який сховав свої гроші на цій же галявині і бере молодших дітей наших сімей у заручники - він вимагає повернути гроші, які зникли зі схованки.','Юрій Ткач'),(20,'ВОВК І ЛЕВ','vovk i lev.jpeg',0,'Волк и лев.mp4','3D','2021','сімейний','Жиль де Метр','Studio Canal, Canal+','Франція, Канада',99,'0','Юна піаністка Альма повертається до будинку, де пройшло її дитинство. Одного разу вона знаходить маленьких вовченят і левенят, які опинилися одні в дикій природі. Альма рятує їх і таємно залишає у своєму домі. Вони дорослішають разом, і здається, що їхню дружбу ніщо не може зруйнувати. Але одного разу їхній секрет розкривають. Левеня ловлять і відправляють у бродячий цирк, а вовченя забирають для досліджень вчені. Тепер усім трьом доведеться вирушити в неймовірну та небезпечну подорож, щоб знову знайти сім\'ю.','Моллі Кунц, Грім Грін, Чарлі Каррік'),(21,'ЗОЛОТО','zoloto.jpeg',1,'Gold (2022).mp4','2D','2022','Триллер','Энтони Хэйес','SunJive Studios/Deeper Water/Rogue Star Productions','Австралія',96,'16','Майбутнє. Ресурси закінчуються. Люди виживають як можуть. Два попутники вирушають у небезпечну зону — на покинутий копальні в пустелі. Коли вони знаходять величезні поклади золота, досвідченіший шукач вирушає за технікою, а молодий залишається чатувати на скарб. Наближається піщана буря, навколо снують дикі тварини та небезпечні мандрівники, а напарник не виходить на зв\'язок.','Ентоні Хейєс'),(25,'Морбіус','morbius.jpeg',1,'Морбіус.mp4','2D','2022','Трилер, Фантастика, Пригоди','Деніел Еспіноза','Sony Pictures, Marvel Studios','США',120,'16','Майкл Морбиус с детства страдает от редкого заболевания крови и всю свою сознательную жизнь посвятил поискам лекарства. В какой-то момент Майкл видит возможное спасение в крови летучих мышей и решается на рискованный эксперимент. Опыт вызывает неожиданную реакцию: вступив в связь с больными клетками, он меняет тело Морбиуса, превращая его в кровожадного монстра.','Джаред Літо, Метт Сміт, Адріа Архона'),(26,'Доктор Стрендж','Doctar Strange.jpeg',1,'ДОКТОР СТРЕНДЖ.mp4','2D','2022','Фантастика, Бойовик','Сем Реймі','Marvel Studios','США',126,'12','Новий фільм «Доктор Стрендж у Мультивсесвіті божевілля» від Marvel Studios відкриває Мультивсесвіт та розширює його межі, як ніколи раніше. Глядач порине у незвідане разом із Доктором Стренджем. З допомогою уже знайомих і нових містичних союзників він перетне дивовижні та небезпечні альтернативні реальності, щоб протистояти таємничому супротивнику.','Бенедикт Камбербетч, Елізабет Олсен, Рейчел МакАдамс, Бенедикт Вонґ'),(27,'Uncharted: Незвідане','Uncharted.jpeg',1,'Uncharted.mp4','2D','2022','Пригоди, Бойовик','Рубен Флейшер','Sony Pictures Entertainment','США',100,'12','Одна з найвідоміших комп\'ютерних ігор оживе на великому екрані! До рук невтомного шукача пригод Натана Дрейка потрапляє загадковий артефакт. Саме він може привести молодого авантюриста до острова, де заховано омріяні скарби.','Том Холланд, Марк Волбер, Антонио Бандерас.'),(28,'Бетмен','betman.jpeg',1,'The Batman.mp4','2D','2022','Детектив, Драма, Бойовик','Метт Рівз','Warner Bros. Pictures, DC Entertainment','США',175,'16','Минуло майже два роки, як Бетмен з\'явився на вулицях Готема. Самотній борець за правосуддя став втіленням розплати жителям міста. Міста, що кишить корумпованими чиновниками. Там Брюс Вейн може довіряти лише двом людям: Альфреду Пенніворту та лейтенанту Джеймсу Гордону. Якось Бетмен зустрічає загадкового вбивцю, який по-садистськи переслідує еліту Готема. Слід дивовижних доказів веде розслідування найкращого детектива до пекла злочинного світу, на дно Готем-сіті.','Роберт Паттінсон, Зої Кравіц, Колін Фаррелл, Пол Дано, Енді Серкіс, Пітер Сарсгаард, Джон Туртурро');
/*!40000 ALTER TABLE `film` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2022-07-04  9:47:29
